Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/armcc/armcc/startup_pic32ck2051sg00100.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NonMaskableInt_Handler    PROC
                          EXPORT NonMaskableInt_Handler    [WEAK] 
                          B       .
                          ENDP
HardFault_Handler         PROC
                          EXPORT HardFault_Handler         [WEAK] 
                          B       .
                          ENDP
MemoryManagement_Handler  PROC
                          EXPORT MemoryManagement_Handler  [WEAK] 
                          B       .
                          ENDP
BusFault_Handler          PROC
                          EXPORT BusFault_Handler          [WEAK] 
                          B       .
                          ENDP
UsageFault_Handler        PROC
                          EXPORT UsageFault_Handler        [WEAK] 
                          B       .
                          ENDP
SecureFaultMonitor_Handler PROC
                          EXPORT SecureFaultMonitor_Handler [WEAK] 
                          B       .
                          ENDP
SVC_Handler               PROC
                          EXPORT SVC_Handler               [WEAK] 
                          B       .
                          ENDP
DebugMonitor_Handler      PROC
                          EXPORT DebugMonitor_Handler      [WEAK] 
                          B       .
                          ENDP
PendSV_Handler            PROC
                          EXPORT PendSV_Handler            [WEAK] 
                          B       .
                          ENDP
SysTick_Handler           PROC
                          EXPORT SysTick_Handler           [WEAK] 
                          B       .
                          ENDP

Default_Handler PROC
                EXPORT  FCR_ERR_Handler           [WEAK]
                EXPORT  FCR_FLT_Handler           [WEAK]
                EXPORT  FCW_Handler               [WEAK]
                EXPORT  PM_Handler                [WEAK]
                EXPORT  SUPC_Handler              [WEAK]
                EXPORT  OSCCTRL_XOSC_Handler      [WEAK]
                EXPORT  OSCCTRL_DFLL_Handler      [WEAK]
                EXPORT  OSCCTRL_PLL0_Handler      [WEAK]
                EXPORT  OSC32KCTRL_Handler        [WEAK]
                EXPORT  MCLK_Handler              [WEAK]
                EXPORT  FREQM_Handler             [WEAK]
                EXPORT  WDT_Handler               [WEAK]
                EXPORT  RTC_Handler               [WEAK]
                EXPORT  EIC_EXTINT_0_Handler      [WEAK]
                EXPORT  EIC_EXTINT_1_Handler      [WEAK]
                EXPORT  EIC_EXTINT_2_Handler      [WEAK]
                EXPORT  EIC_EXTINT_3_Handler      [WEAK]
                EXPORT  EIC_EXTINT_4_Handler      [WEAK]
                EXPORT  EIC_EXTINT_5_Handler      [WEAK]
                EXPORT  EIC_EXTINT_6_Handler      [WEAK]
                EXPORT  EIC_EXTINT_7_Handler      [WEAK]
                EXPORT  EIC_EXTINT_8_Handler      [WEAK]
                EXPORT  EIC_EXTINT_9_Handler      [WEAK]
                EXPORT  EIC_EXTINT_10_Handler     [WEAK]
                EXPORT  EIC_EXTINT_11_Handler     [WEAK]
                EXPORT  EIC_EXTINT_12_Handler     [WEAK]
                EXPORT  EIC_EXTINT_13_Handler     [WEAK]
                EXPORT  EIC_EXTINT_14_Handler     [WEAK]
                EXPORT  EIC_EXTINT_15_Handler     [WEAK]
                EXPORT  EIC_NSCHK_Handler         [WEAK]
                EXPORT  PAC_Handler               [WEAK]
                EXPORT  TRAM_Handler              [WEAK]
                EXPORT  PORT_Handler              [WEAK]
                EXPORT  DMA0_PRI0_Handler         [WEAK]
                EXPORT  DMA0_PRI1_Handler         [WEAK]
                EXPORT  DMA0_PRI2_Handler         [WEAK]
                EXPORT  DMA1_PRI0_Handler         [WEAK]
                EXPORT  DMA1_PRI1_Handler         [WEAK]
                EXPORT  HMATRIX_Handler           [WEAK]
                EXPORT  EVSYS_0_Handler           [WEAK]
                EXPORT  EVSYS_1_Handler           [WEAK]
                EXPORT  EVSYS_2_Handler           [WEAK]
                EXPORT  EVSYS_3_Handler           [WEAK]
                EXPORT  EVSYS_OTHER_Handler       [WEAK]
                EXPORT  SERCOM0_56_Handler        [WEAK]
                EXPORT  SERCOM0_0_Handler         [WEAK]
                EXPORT  SERCOM0_1_Handler         [WEAK]
                EXPORT  SERCOM0_2_Handler         [WEAK]
                EXPORT  SERCOM0_3_Handler         [WEAK]
                EXPORT  SERCOM0_4_Handler         [WEAK]
                EXPORT  SERCOM1_56_Handler        [WEAK]
                EXPORT  SERCOM1_0_Handler         [WEAK]
                EXPORT  SERCOM1_1_Handler         [WEAK]
                EXPORT  SERCOM1_2_Handler         [WEAK]
                EXPORT  SERCOM1_3_Handler         [WEAK]
                EXPORT  SERCOM1_4_Handler         [WEAK]
                EXPORT  SERCOM2_56_Handler        [WEAK]
                EXPORT  SERCOM2_0_Handler         [WEAK]
                EXPORT  SERCOM2_1_Handler         [WEAK]
                EXPORT  SERCOM2_2_Handler         [WEAK]
                EXPORT  SERCOM2_3_Handler         [WEAK]
                EXPORT  SERCOM2_4_Handler         [WEAK]
                EXPORT  SERCOM3_56_Handler        [WEAK]
                EXPORT  SERCOM3_0_Handler         [WEAK]
                EXPORT  SERCOM3_1_Handler         [WEAK]
                EXPORT  SERCOM3_2_Handler         [WEAK]
                EXPORT  SERCOM3_3_Handler         [WEAK]
                EXPORT  SERCOM3_4_Handler         [WEAK]
                EXPORT  TCC0_OTHER_Handler        [WEAK]
                EXPORT  TCC0_MC0_Handler          [WEAK]
                EXPORT  TCC0_MC1_Handler          [WEAK]
                EXPORT  TCC0_MC2_Handler          [WEAK]
                EXPORT  TCC0_MC3_Handler          [WEAK]
                EXPORT  TCC0_MC4_Handler          [WEAK]
                EXPORT  TCC0_MC5_Handler          [WEAK]
                EXPORT  TCC1_OTHER_Handler        [WEAK]
                EXPORT  TCC1_MC0_Handler          [WEAK]
                EXPORT  TCC1_MC1_Handler          [WEAK]
                EXPORT  TCC1_MC2_Handler          [WEAK]
                EXPORT  TCC1_MC3_Handler          [WEAK]
                EXPORT  TCC1_MC4_Handler          [WEAK]
                EXPORT  TCC1_MC5_Handler          [WEAK]
                EXPORT  TCC2_OTHER_Handler        [WEAK]
                EXPORT  TCC2_MC0_Handler          [WEAK]
                EXPORT  TCC2_MC1_Handler          [WEAK]
                EXPORT  TCC2_MC2_Handler          [WEAK]
                EXPORT  TCC2_MC3_Handler          [WEAK]
                EXPORT  TCC2_MC4_Handler          [WEAK]
                EXPORT  TCC2_MC5_Handler          [WEAK]
                EXPORT  TCC3_OTHER_Handler        [WEAK]
                EXPORT  TCC3_MC0_Handler          [WEAK]
                EXPORT  TCC3_MC1_Handler          [WEAK]
                EXPORT  TCC3_MC2_Handler          [WEAK]
                EXPORT  TCC3_MC3_Handler          [WEAK]
                EXPORT  TCC3_MC4_Handler          [WEAK]
                EXPORT  TCC3_MC5_Handler          [WEAK]
                EXPORT  SERCOM4_56_Handler        [WEAK]
                EXPORT  SERCOM4_0_Handler         [WEAK]
                EXPORT  SERCOM4_1_Handler         [WEAK]
                EXPORT  SERCOM4_2_Handler         [WEAK]
                EXPORT  SERCOM4_3_Handler         [WEAK]
                EXPORT  SERCOM4_4_Handler         [WEAK]
                EXPORT  SERCOM5_56_Handler        [WEAK]
                EXPORT  SERCOM5_0_Handler         [WEAK]
                EXPORT  SERCOM5_1_Handler         [WEAK]
                EXPORT  SERCOM5_2_Handler         [WEAK]
                EXPORT  SERCOM5_3_Handler         [WEAK]
                EXPORT  SERCOM5_4_Handler         [WEAK]
                EXPORT  SERCOM6_56_Handler        [WEAK]
                EXPORT  SERCOM6_0_Handler         [WEAK]
                EXPORT  SERCOM6_1_Handler         [WEAK]
                EXPORT  SERCOM6_2_Handler         [WEAK]
                EXPORT  SERCOM6_3_Handler         [WEAK]
                EXPORT  SERCOM6_4_Handler         [WEAK]
                EXPORT  SERCOM7_56_Handler        [WEAK]
                EXPORT  SERCOM7_0_Handler         [WEAK]
                EXPORT  SERCOM7_1_Handler         [WEAK]
                EXPORT  SERCOM7_2_Handler         [WEAK]
                EXPORT  SERCOM7_3_Handler         [WEAK]
                EXPORT  SERCOM7_4_Handler         [WEAK]
                EXPORT  TCC4_OTHER_Handler        [WEAK]
                EXPORT  TCC4_MC0_Handler          [WEAK]
                EXPORT  TCC4_MC1_Handler          [WEAK]
                EXPORT  TCC5_OTHER_Handler        [WEAK]
                EXPORT  TCC5_MC0_Handler          [WEAK]
                EXPORT  TCC5_MC1_Handler          [WEAK]
                EXPORT  TCC6_OTHER_Handler        [WEAK]
                EXPORT  TCC6_MC0_Handler          [WEAK]
                EXPORT  TCC6_MC1_Handler          [WEAK]
                EXPORT  TCC7_OTHER_Handler        [WEAK]
                EXPORT  TCC7_MC0_Handler          [WEAK]
                EXPORT  TCC7_MC1_Handler          [WEAK]
                EXPORT  ADC_GLOBAL_Handler        [WEAK]
                EXPORT  ADC_CORE1_Handler         [WEAK]
                EXPORT  AC_Handler                [WEAK]
                EXPORT  PTC_Handler               [WEAK]
                EXPORT  SPI_IXS_Handler           [WEAK]
                EXPORT  PCC_Handler               [WEAK]
                EXPORT  PDEC_Handler              [WEAK]
                EXPORT  SQI_Handler               [WEAK]
                EXPORT  TRNG_Handler              [WEAK]
                EXPORT  SDMMC0_Handler            [WEAK]
                EXPORT  SDMMC1_Handler            [WEAK]
                EXPORT  USB_OTHER_Handler         [WEAK]
                EXPORT  USB_SOF_Handler           [WEAK]
                EXPORT  USB_TRCPT0_Handler        [WEAK]
                EXPORT  USB_TRCPT1_Handler        [WEAK]
                EXPORT  USBHS_Handler             [WEAK]
                EXPORT  HSM_ERROR_Handler         [WEAK]
                EXPORT  HSM_TXINT_Handler         [WEAK]
                EXPORT  HSM_RXINT_Handler         [WEAK]


